// Визначення типу геометричної фігури за допомогою switch:
// Створіть код, який приймає назву геометричної фігури ("коло", "квадрат", "трикутник") і використовуючи switch оператор, виводить повідомлення про кількість сторін цієї фігури (наприклад, "Коло має 0 сторін", "Квадрат має 4 сторони").

let figure = prompt(
  `Напишіть назву геометричної фігури: "коло", "квадрат", "трикутник"`
);
switch (figure) {
  case "коло":
    console.log(`Коло немає 0 сторін`);
    break;

  case "квадрат":
    console.log(`Квадрат має 4 сторони`);
    break;

  case "трикутник":
    console.log(`Трикутник має 3 строни`);
    break;
}

// Підрахунок суми парних чисел:
// Створіть код, який використовує цикл while для знаходження суми всіх парних чисел в заданому діапазоні (наприклад, від 1 до 20).

let Value = 0;
let result = 0;
while (Value < 21) {
  Value++;
  if (Value % 2 == 0) result += Value;
}
console.log(`Сума парних чисел ${result}`);

// Таблиця множення:
// Використовуючи цикл for, напишіть програму, яка генерує "таблицю множення" виводимо в console.log операції  для конкретного числа (наприклад, для числа 5).
let number = 5;
let resultNumber = 0;
for (let i = 0; i < 10; i++) {
  resultNumber = i * 5;
  console.log(resultNumber);
}

// Зворотний лічильник:
// Використовуючи цикл for, напишіть програму, яка виводить числа від 10 до 1 в зворотньому порядку.

for (let i = 10; i > 0; i--) {
  console.log(i);
}

// Визначення чи є число парним чи непарним:
// Напишіть програму, яка приймає число і використовуючи if та for, виводить повідомлення про те, чи є число парним чи непарним.

let userValue = prompt(`Введіть число від 1 до 50`);
let userResult;
if (userValue <= 50) {
  for (let i = 0; i <= userValue; i++) result = 1;
  if (userValue % 2 == 0) {
    console.log(`Число є парним ${userResult}`);
  } else {
    console.log(`Число є не парним ${userResult}`);
  }
} else {
  console.log(`Ви ввели не правильне число ${userResult}`);
}

// Знаходження першого парного числа:
// Напишіть програму, яка використовує цикл for для перебору чисел від 1 до 10 і виводить перше знайдене парне число. Використайте оператор break, щоб припинити виконання циклу, якщо парне число знайдено.

for (let i = 1; i < 11; i++) {
  if (i % 2 == 0) {
    console.log(`Перше парне число ${i}`);
    break;
  }
}

// Виведення парних чисел:
// Створіть програму, яка використовує цикл for для перебору чисел від 1 до 10 і виводить тільки парні числа. Використайте оператор continue, щоб пропустити ітерації для непарних чисел.

for (let i = 1; i < 11; i++) {
  if (i % 2 !== 0) {
    continue;
  }
  console.log(`Всі парні числа від 1 до 10 ${i}`);
}
